Revit 2027 API
FabricationPart.RotateConnectedTap Method
 Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RotateConnectedTap(
	Document document,
	FabricationPart tap,
	double primaryAxisRotateBy,
	double secondaryAxisRotateBy
)
Public Shared Sub RotateConnectedTap (
	document As Document,
	tap As FabricationPart,
	primaryAxisRotateBy As Double,
	secondaryAxisRotateBy As Double
)
public:
static void RotateConnectedTap(
	Document^ document,
	FabricationPart^ tap,
	double primaryAxisRotateBy,
	double secondaryAxisRotateBy
)
static member RotateConnectedTap :
        document : Document *
        tap : FabricationPart *
        primaryAxisRotateBy : float *
        secondaryAxisRotateBy : float -> unit
Parameters
document Document
 The document.
tap FabricationPart
 The connected fabrication part tap to rotate.
primaryAxisRotateBy Double
 The primary axis rotation angle in radians to rotate by.
secondaryAxisRotateBy Double
 The secondary axis rotation angle in radians to rotate by.
Exceptions
Exception | Condition
ArgumentException |  Is not connected as a fabrication part tap. -or- tap cannot be rotated about the primary axis by the specified angle: primaryAxisRotateBy -or- tap cannot be rotated about the secondary axis by the specified angle: secondaryAxisRotateBy
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace